---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GridCenterSegmentStyle
source: html/c70cdd24-b6e7-21eb-ff9c-a452e84949d6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GridCenterSegmentStyle Property

"Center Segment"

## Syntax (C#)
```csharp
public static ForgeTypeId GridCenterSegmentStyle { get; }
```